xmlsamples/PI_MTCN/FR-SMS-BIS.xml

<soapenv:Envelope xmlns:xrsi="http://www.westernunion.com/schema/xrsi" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Body>
      <xrsi:esp-send-money-store-request>
         <partner>
            <id>WGBSQAH010T</id>
            <system>
               <id>WGBSQAH010T</id>
               <name>QNB</name>
               <version>9101</version>
               <ip_address>172.31.19.212</ip_address>
               <connector>
                  <id>QAH01ETW01A</id>
               </connector>
            </system>
         </partner>
         <device>
            <id>Online</id>
            <type>WEB</type>
         </device>
         <external_reference_no>1</external_reference_no>
         <sender>
            <name>
               <first_name>SCRAMBLEPRX</first_name>
               <last_name>HASSAN I M ALIBRAHIM</last_name>
            </name>
            <address>
               <addr_line1>ADDRESS2</addr_line1>
               <addr_line2>ADDRESS3-</addr_line2>
               <city>ADDRESS3</city>
               <postal_code>ZIPNO</postal_code>
            </address>
            <preferred_customer/>
            <compliance_details>
               <id_documents>
                  <id_document>
                     <type>NATIONAL_ID</type>
                     <data>24763400033</data>
                  </id_document>
               </id_documents>
               <date_of_birth>08121947</date_of_birth>
               <Country_of_Birth>QA</Country_of_Birth>
               <Does_the_sender_have_ID>Y</Does_the_sender_have_ID>
               <ack_flag>Y</ack_flag>
            </compliance_details>
            <email>0000331@Scramble.com</email>
            <contact_phone>97477114499</contact_phone>
            <gender/>
            <language_iso_code/>
            <place_of_birth/>
            <occupation/>
            <employer_name/>
            <notification_preference>NONE</notification_preference>
            <mothers_maiden_name/>
            <sms_notification_flag>N</sms_notification_flag>
            <bank_account>
               <name>QNB</name>
               <account_number>0066000033001</account_number>
               <routing_number>987654321</routing_number>
            </bank_account>
         </sender>
         <receiver>
            <name>
               <first_name>new</first_name>
               <middle_name>sit</middle_name>
               <last_name>build</last_name>
            </name>
            <address>
               <addr_line1/>
               <addr_line2/>
               <city/>
               <state/>
               <postal_code/>
               <country_iso_code/>
               <locale/>
               <address_type/>
               <business_name/>
               <country_code>
                  <country_name/>
               </country_code>
            </address>
            <email/>
            <contact_phone/>
            <notification_preference>NONE</notification_preference>
            <reason_for_sending>Family Support</reason_for_sending>
            <cash_to_mobile>
               <sp_id_sp_name/>
               <sender_sms_flag/>
               <sender_selected_language>EN</sender_selected_language>
               <reciever_selected_language>EN</reciever_selected_language>
               <receiver_sms_flag/>
            </cash_to_mobile>
            <sms_notification_flag>Y</sms_notification_flag>
         </receiver>
         <wu_product>
            <name>MONEY IN MINUTES</name>
            <code>000</code>
            <routing_code/>
         </wu_product>
         <transaction_type>WMN</transaction_type>
         <payment_details>
            <origination>
               <principal_amount>95000</principal_amount>
               <gross_amount>96500</gross_amount>
               <currency_iso_code>QAR</currency_iso_code>
               <country_iso_code>QA</country_iso_code>
            </origination>
            <destination>
               <expected_payout_amount>22620</expected_payout_amount>
               <currency_iso_code>EUR</currency_iso_code>
               <country_iso_code>FR</country_iso_code>
               <state_code/>
               <city/>
            </destination>
            <promotion>
               <name/>
               <code/>
               <description/>
               <discount>000</discount>
               <message/>
            </promotion>
            <taxes>
               <tax_amount>000</tax_amount>
               <municipal_tax>0</municipal_tax>
               <state_tax>0</state_tax>
               <county_tax>0</county_tax>
            </taxes>
            <fees>
               <base_charges>1500</base_charges>
               <delivery_charges>0</delivery_charges>
               <other_charges>0</other_charges>
            </fees>
            <message_charges/>
            <exchange_rate>0.2381020</exchange_rate>
            <identification_question>
               <question/>
               <answer/>
            </identification_question>
            <payment_digest>03660109AQA229996020595000030100403QAT0503FRZ06030000703FRZ0803WMN09000358100012041500130101401015059650016041500170101901020002101N0312220023002400</payment_digest>
         </payment_details>
         <additional_service_options>
            <additional_service_option>
               <name>NOTIFICATION</name>
               <code>051</code>
               <discounted_surcharge>0</discounted_surcharge>
               <taxes>
                  <tax_amount>0</tax_amount>
               </taxes>
            </additional_service_option>
         </additional_service_options>
         <temp_transaction_id>2400984552144516</temp_transaction_id>
         <transaction_digest>45C94CCF22CC637665039447E97B30F47578A2EF</transaction_digest>
      </xrsi:esp-send-money-store-request>
   </soapenv:Body>
</soapenv:Envelope>